book/assets/assessments/hangmanPython.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-23 Sun 11:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hangman in Python (starter kit)</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Hangman in Python (starter kit)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7456d98">1. Words of Encouragement</a></li>
<li><a href="#orgcc7d073">2. Task</a></li>
<li><a href="#orgb0140ef">3. Detail - tackle this in steps.</a></li>
<li><a href="#org5d3230c">4. Comments</a>
<ul>
<li><a href="#org030acf9">4.1. How I Will Grade</a></li>
<li><a href="#org7ec552d">4.2. Hints</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7456d98" class="outline-2">
<h2 id="org7456d98"><span class="section-number-2">1.</span> Words of Encouragement</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the first non-trivial thing we will have done in the programming line. Do not get too frustrated if it takes you several submissions to get things right.
</p>

<p>
Remember our goal is to learn some programming basics, not to write a production quality game of hangman. It is better to spend your time perfecting your ability to get the basic pieces
</p>

<p>
We all start as beginners. Be patient with yourself.
</p>

<p>
It is <b>fine</b> to collaborate, but don't just turn in a working piece of code you got from someone, because while that will give you points, it will not provide you an education. Make sure you can write it yourself from scratch even if that is only after you have worked on it together with someone.
</p>

<p>
How to work. I like the idea of having a console open on one side for testing and another editor window where I can write code. I write in one window. Test in the other, and go back and forth to get something I can use. Ask me to demo in class if you are not clear on what this is supposed to look like. 
</p>
</div>
</div>

<div id="outline-container-orgcc7d073" class="outline-2">
<h2 id="orgcc7d073"><span class="section-number-2">2.</span> Task</h2>
<div class="outline-text-2" id="text-2">
<p>
To write the beginning pieces of a hangman game in python. This version will <a href="https://en.wikipedia.org/wiki/Hard_coding">hard code</a> the word to be guessed. It will not produce any sort of graphic, You will ask the user for  letters and report if the player spells out the word or not. Depending on how fast you master that, I may suggest further improvements when you submit. 
</p>
</div>
</div>

<div id="outline-container-orgb0140ef" class="outline-2">
<h2 id="orgb0140ef"><span class="section-number-2">3.</span> Detail - tackle this in steps.</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Look up how to get user input from python on the command line.
Write a script<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> that when run from the terminal (command line) asks for a word, and prints it out.</li>
<li>Write a <code>function</code> that takes as input a word. The function asks the user to guess a letter and returns <b>a list of</b> indices of the positions where the letter exists in the word. An empty list means the letter is not to be found in the word. Otherwise, the elements of this list are the indices where that letter is found. For example, if the word were "tree" and the letter "e" was guessed you would get back <code>[2,3]</code> from this function, but you would get back <code>[]</code> if the user supplied the letter were "s".<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup></li>
<li>Write a function that accepts as input a number, which we will interpret as the maximum number of guesses a player is allowed (call it <code>max_times</code>). This function will use a word that you have hard coded as a constant and will loop through the guessing function above for max<sub>times</sub> or until all the letter in the word have been guessed.</li>
<li>If the number of user guesses is greater than <code>max_times</code> your program should print "You lose." If the user guesses all the letters print "You win". And exit the program.</li>
</ol>
</div>
</div>

<div id="outline-container-org5d3230c" class="outline-2">
<h2 id="org5d3230c"><span class="section-number-2">4.</span> Comments</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org030acf9" class="outline-3">
<h3 id="org030acf9"><span class="section-number-3">4.1.</span> How I Will Grade</h3>
<div class="outline-text-3" id="text-4-1">
<p>
I will run your program from the terminal, and it will work as above or it will not. If it does, I will give you full marks, if not, I will give partial credit and allow you to try and fix the mistakes. 
</p>
</div>
</div>
<div id="outline-container-org7ec552d" class="outline-3">
<h3 id="org7ec552d"><span class="section-number-3">4.2.</span> Hints</h3>
<div class="outline-text-3" id="text-4-2">
<p>
You might find it useful to learn about python's <code>in</code> operator, and to think about how you might use the <code>enumerate</code> function we used in the <a href="forLoopPythonAssessment.html">for loop in python assessment</a>.
Remember to eliminate the letters from your word as they are guessed. For example if the word is tree, and I guess "e", your word should become "tr". That means you may find it easier to keep track of the indices that are <b>not</b> equal to the guessed letters.
If a brute force solution comes quickly think about re-writing your answer using a <a href="https://www.programiz.com/python-programming/list-comprehension">list comprehension</a>.
If you have more of a programming background try adding in some additional features of the game. Can you get a random word from the internet? Can you let the player give the word and the computer guess letters? Could you output where the guessed characters appear in the word before the player has to make their next guess. Could you generate some <a href="https://codegolf.stackexchange.com/questions/135936/ascii-hangman-in-progress">simple ascii art of the hangman character</a>?
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
A script is a file that ends with .py and that I can call from the terminal. If your script is named hangman.py then things should work when I do <code>python hangman.py</code> in my terminal window.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Why is it 2,3 and not 3,4? 
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-04-23 Sun 11:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>